* HP 48GX ROM revision R, #F6FB8-#FA04C: Library part 0E2
* Addresses in the right-hand comments are those of the original ROM.
* Follows on from the previous file (at #F6FB8 in the original ROM).
        RPL

* ROMPTR 0E2 038
* refs (1): E3857
ROMP_0E2_038:
        {                                        * F6FB8
          BINT16                                 * F6FBD
          BINT5                                  * F6FC2
          CON(5)  DOHSTR                         * F6FC7  DOHSTR
          LENGTH                                 * F6FCC  length, to #F72A8
          NIBHEX  B205F800022901024190102858030B80 * F6FD1  +P↓. δ. ...∇Σ0°.
          NIBHEX  E780003680308401480402803F58010B * F6FF1  ~..c..H.∫@ .óΣ.°
          NIBHEX  C6804027828580108468040206245801 * F7011  l..r(X..H▶@ `BΣ.
          NIBHEX  0B8680002C80604020002C80604123C0 * F7031  °h..Â.....Â...2.
          NIBHEX  2C80608CA033EC802083E0902080A580 * F7051  Â..È.3Î..8....Z.
          NIBHEX  30FE015807110120000F003060000401 * F7071  .ï.Σp....ð....@.
          NIBHEX  00248040F000858000148072F0400010 * F7091  .B....X..A.'....
          NIBHEX  0040672000800F20002000C040200078 * F70B1  ..v...ð........π
          NIBHEX  580D0409D4340208007580B040434440 * F70D1  ΣÐ@↑MC ∡.W...4D.
          NIBHEX  407E480E0800804144E0C01F480E0800 * F70F1  .ç∫à∡...D..ñ∫à∡.
          NIBHEX  80410400707F780D0808103007CFF015 * F7111  ..@..÷πÐ∡∡..pü.Q
          NIBHEX  80008680C0FEFE030008008580D04FFF * F7131  ..h..ïï0.∡.X..ôÿ
          NIBHEX  E07000800848070157FF107580D08020 * F7151  ....∡∫p.uÿ.W....
          NIBHEX  008E1FC10F58053402000840F801F001 * F7171  .èñ.ðΣPC .∡.↓...
          NIBHEX  00040A8003FF8871F002000207000C08 * F7191  .@..0ÿ∂.. . p.À∡
          NIBHEX  70F1F580D0102000C0C71F1F680C08F8 * F71B1  .._......|ññ▶À∡↓
          NIBHEX  FF3F381E1F480823070000C4C71F1F00 * F71D1  ÿó√áñ∫∡2p..L|ññ.
          NIBHEX  00FC010000CE870F1F00001E580D0D50 * F71F1  .Ï...ìxðñ..áΣÐÐ.
          NIBHEX  F871F00C001580B0840F800F0038780C * F7211  ↓..À.Q..Hð.ð.√πÀ
          NIBHEX  1801FC00F00070000F8FFFF40F007F68 * F7231  ā.Ï.....ðøÿOð.÷▶
          NIBHEX  000248038F30070E58000748070FEFFC * F7251  . ∫0ø.pàΣ.p∫pðþÏ
          NIBHEX  301580B0A80000FCFF3D78000248050F * F7271  .Q..≥..ÏÿÓπ. ∫Pð
          NIBHEX  0FF0378000248030C07F980        * F7291  ð.s..B...÷≤
        ENDLENGTH                                * F72A8
        }                                        * F72A8

* ROMPTR 0E2 039
* refs (1): E3857
ROMP_0E2_039:
        {                                        * F72AD
          BINT24                                 * F72B2
          BINT5                                  * F72B7
          CON(5)  DOHSTR                         * F72BC  DOHSTR
          LENGTH                                 * F72C1  length, to #F75C2
          NIBHEX  C285A80002B8000478050200008680E0 * F72C6  ,X≥. ≠.@πP ..h..
          NIBHEX  400200001E00009680E0400100002200 * F72E6  . ..á..i......".
          NIBHEX  00A680B0C0FFFF3F22FE38F580E04001 * F7306  .j...ÿÿó"ï√_....
          NIBHEX  0000220000A680E04002000022000096 * F7326  .."..j... .."..i
          NIBHEX  80004C800088C0F08061188661188661 * F7346  ..Ä..∂....āh.āh.
          NIBHEX  580F04092244992244992580F0409224 * F7366  Σð@↑"Dτ"DτR...)B
          NIBHEX  4992244992580F040922449922449925 * F7386  η)Bη)Σð@↑"Dτ"DτR
          NIBHEX  8010F8D8FF7030000481004411004411 * F73A6  ..↓→ÿ...@..D..D.
          NIBHEX  00200004810044110044110020000481 * F73C6  ...@..D..D....@.
          NIBHEX  00441100441100200004810044110044 * F73E6  .D..D....@..D..D
          NIBHEX  11002000048100441100441100200004 * F7406  ....@..D..D....@
          NIBHEX  81004411004F7411022E900481004411 * F7426  ..D..ôG. â.@..D.
          NIBHEX  00441102219004810044110044110220 * F7446  .D. ..@..D..D. .
          NIBHEX  90048100441100441102209004810044 * F7466  .@..D..D. ..@..D
          NIBHEX  110044110E20A0048100441100441102 * F7486  ..D.à..@..D..D. 
          NIBHEX  20000481004411510044110020000481 * F74A6  ..@..D...D....@.
          NIBHEX  00441100441100200004810044110044 * F74C6  .D..D....@..D..D
          NIBHEX  1100200004810044110044110020000F * F74E6  ....@..D..D....ð
          NIBHEX  8D8F510300004092244992244992580F * F7506  Øø.0...)Bη)Bη)Σð
          NIBHEX  04092244992244992580F04092244992 * F7526  @↑"Dτ"DτR...)Bη)
          NIBHEX  244992580F0400CC3300CC3308C58000 * F7546  Bη)Σð@.Ì3.Ì3∡\..
          NIBHEX  4C8000858020143B800085802017FB80 * F7566  Ä..X..A³..X..q¿.
          NIBHEX  008580001D80008580001D8000858000 * F7586  .X..Ñ..X..Ñ..X..
          NIBHEX  1D80008580001F8F380301F03190   * F75A6  Ñ..X..ñø√0....
        ENDLENGTH                                * F75C2
        }                                        * F75C2

* ROMPTR 0E2 03A
* refs (1): E3857
ROMP_0E2_03A:
        {                                        * F75C7
          BINT16                                 * F75CC
          BINT5                                  * F75D1
          CON(5)  DOHSTR                         * F75D6  DOHSTR
          LENGTH                                 * F75DB  length, to #F79BE
          NIBHEX  F2869800067901029790105969010FD9 * F75E0  /h≤.`ρ. y..θλ.ðΩ
          NIBHEX  8F50CFFF0758040800FE480908000409 * F7600  ø.üÿpΣ@∡.ï∫↑∡.@↑
          NIBHEX  204580318010800300C0014049065803 * F7620  .T.....0....η`Σ0
          NIBHEX  16010800C00A002C0240558031103040 * F7640  a.∡....Â .U.....
          NIBHEX  30018000409204680A582060E0028000 * F7660  .....)@▶.Σ... ..
          NIBHEX  40490600008007602080020000C02405 * F7680  .η`...p... ...BP
          NIBHEX  00004006E02F80020000C0FF07000040 * F76A0  ...`.ò. ...ÿp...
          NIBHEX  0DD8728001740E980F0C01886A281020 * F76C0  Ð→'..Gà≤ðÀ.∂¦∇..
          NIBHEX  C1198005806005A17202041140040400 * F76E0  .γ.P..P.' @..@@.
          NIBHEX  0040C004401C040411480424000040C0 * F7700  ...@.Á@@.∫@B....
          NIBHEX  03000C04040E503C14000020258031C0 * F7720  0.À@@à.ÃA...R...
          NIBHEX  800007E44FC000020348041140800005 * F7740  ..pNô.. 0∫@....P
          NIBHEX  04414000320148041183880004844240 * F7760  @...#.∫@.8∂.@H$.
          NIBHEX  0FFFF348012105080004044040100902 * F7780  ðÿ?∫..P∡.@@...↑ 
          NIBHEX  B00002050A00268021100101E0000F03 * F77A0  .. P..b.......ð0
          NIBHEX  FC001680F01001008000128108480F01 * F77C0  Ï.a.......!.∡∫ð.
          NIBHEX  0000100100880FE98F21EF0701001008 * F77E0  .....∂ð■ø.þp...∡
          NIBHEX  0001201680211000010010080000201A * F7800  ...a.......∡...¡
          NIBHEX  80311F00103800002010000478040FF1 * F7820  ..ñ..√.....@π@ð.
          NIBHEX  F548020101D803032054807018087406 * F7840  _∫ ..→00.E..ā∡G`
          NIBHEX  980202074807034080C04980F0203800 * F7860  ≤  p∫p0...η...√.
          NIBHEX  00EC180404980F0404E0000842504049 * F7880  .Îā@@≤ð@@..∡$..η
          NIBHEX  80F0C04302800426040E980B0B080054 * F78A0  ...4 .@b@à≤°°∡.E
          NIBHEX  1031AD80B0100187C30102D80B0E0118 * F78C0  ..Ú....x<. →°à.ā
          NIBHEX  C22010109020BF498F50CFFF07680216 * F78E0  ,.....ûηø.üÿp▶ a
          NIBHEX  020282008000409204680D6E01022400 * F7900    (....)@▶Ðæ. B.
          NIBHEX  C001404906490700B100025400A002C0 * F7920  ...η`ηp... E.. .
          NIBHEX  2405C90080C000014C00800040920449 * F7940  BPΠ.....Ä....)@η
          NIBHEX  00404001015B00800040490649C03F40 * F7960  .....µ....η`η.ó.
          NIBHEX  02E1368011C0240557000080FF3F7807 * F7980   .c...BPu...ÿóπp
          NIBHEX  0C0FF0701880009890009890006D80 * F79A0  Àð..ā..≤..≤..Ö.
        ENDLENGTH                                * F79BE
        }                                        * F79BE

* ROMPTR 0E2 03B
* refs (1): E3857
ROMP_0E2_03B:
        {                                        * F79C3
          BINT40                                 * F79C8
          BINT3                                  * F79CD
          CON(5)  DOHSTR                         * F79D2  DOHSTR
          LENGTH                                 * F79D7  length, to #F7C3D
          NIBHEX  130438030F038B80301045B803010658 * F79DC  1@√0ð0¸...T≠0.`Σ
          NIBHEX  8060600F054480A03000600104C480A0 * F79FC  ...ðPD......@L..
          NIBHEX  30006001044480A03000600103848040 * F7A1C  ....@D......0H..
          NIBHEX  30006A804030006A8040300169815003 * F7A3C  ..¦....¦....λ..0
          NIBHEX  00AE98A50FF3F5698550030106A80403 * F7A5C  .ê≤Zð?_λX.0.`≥@0
          NIBHEX  015698550030106A8040301569855003 * F7A7C  .e≤U...¦...QλX.0
          NIBHEX  0106A804030056985500300069805043 * F7A9C  .`≥@0.e≤U...λ..4
          NIBHEX  00569855043000698070C30356007857 * F7ABC  .e≤U@..λ..<0e.πu
          NIBHEX  04304061878070430456247857043040 * F7ADC  @...x..4@eBπu@..
          NIBHEX  624780704304561C7857003000604880 * F7AFC  &t..4@eÁπu....∫.
          NIBHEX  6030056047857003000602880A330156 * F7B1C  ..P.tX.0.` ∂.3.e
          NIBHEX  005500555503010600001E0000430556 * F7B3C  .U.UU0.`..á..4Pe
          NIBHEX  5555225555830306000022480A030156 * F7B5C  UU"UU80`.."∫.0.e
          NIBHEX  55551E58F303F0648000248041300565 * F7B7C  UUáΣ?0.F..B...PV
          NIBHEX  55502555503000648000248041300565 * F7B9C  U.RU...F..B...PV
          NIBHEX  555005555030006A8040300569855003 * F7BBC  U.PU...¦...PλX.0
          NIBHEX  0006A80403005698550030006A804030 * F7BDC  .`≥@0.e≤U...¦...
          NIBHEX  05698550030006A80403005698550030 * F7BFC  PλX.0.`≥@0.e≤U..
          NIBHEX  006A8040300FE98F500300FE98F30030 * F7C1C  .¦...ð■ø.0.ï≤?..
          NIBHEX  0                              * F7C3C
        ENDLENGTH                                * F7C3D
        }                                        * F7C3D

* ROMPTR 0E2 03C
* refs (1): E3857
ROMP_0E2_03C:
        {                                        * F7C42
          BINT16                                 * F7C47
          BINT6                                  * F7C4C
          CON(5)  DOHSTR                         * F7C51  DOHSTR
          LENGTH                                 * F7C56  length, to #F7EFC
          NIBHEX  B206F8030C01F390103F39070F055953 * F7C5B  +`↓0À.?..óεpðPθ5
          NIBHEX  B09060F008022D8090C05455953BD800 * F7C7B  ....∡ Ò...EUY³→.
          NIBHEX  0348050800872B80B0585555953845C8 * F7C9B  0∫P∡.x²..ΣUUY√Tα
          NIBHEX  0A0400FC010077B80B0525521140015C * F7CBB  .@.Ï..w≠°PR%...Å
          NIBHEX  80A010070803A75B8038550A99422B80 * F7CDB  ...p∡0zµ.√U.τ$².
          NIBHEX  0084805020803AB80B0805555251509B * F7CFB  .H....£≠°∡PU%..¹
          NIBHEX  8000448050200039B8090405555271FD * F7D1B  ..D....ε≠↑@PU%.ß
          NIBHEX  80702000F021F806050550F20906010C * F7D3B  ......↓`PP./↑`.À
          NIBHEX  00020906048350021902080839030540 * F7D5B  . ↑`@8. γ ∡∡ε0P.
          NIBHEX  549020202390905501008003B80B0800 * F7D7B  E...2..U...0≠°∡.
          NIBHEX  001004004B80B040D500001104B80202 * F7D9B  ..@.´...]...@≠  
L_F7DBB:
          NIBHEX  08480301103B80905855000091780106 * F7DBB  ∡∫0..³..ΣU...π.`
          NIBHEX  E4801062480105E780114AFCFF551500 * F7DDB  N..&∫.P~..¤ÏÿUQ.
          NIBHEX  00D007580104E58000158000E580B032 * F7DFB  ..pΣ.@^..Q..^..#
          NIBHEX  425455550DB803025E2680008B80C027 * F7E1B  $EUUÐ≠0 åb..¸..r
          NIBHEX  0054E54F051A80102568070102180026 * F7E3B  .E^ôP¡..R▶p. ā.b
          NIBHEX  8001756A5495131111002880E04A0040 * F7E5B  ..W¦EY1...∇..¤..
          NIBHEX  C51011002880E04AFC1F311011002880 * F7E7B  \...∇..¤Ïñ....∇.
          NIBHEX  184480701E01100288010E4480701003 * F7E9B  āD..á.. ∂.àD...0
          NIBHEX  9002C80404005E48010A8B8030800358 * F7EBB  . α@@.å∫..¸...0Σ
          NIBHEX  0007F80001580002A8010FCB8F101F38 * F7EDB  .p↓..Σ. ≥.ð¼ø.ñ√
          NIBHEX  0                              * F7EFB
        ENDLENGTH                                * F7EFC
        }                                        * F7EFC

* ROMPTR 0E2 03D
* refs (1): E3857
ROMP_0E2_03D:
        {                                        * F7F01
          BINT24                                 * F7F06
          BINT5                                  * F7F0B
          CON(5)  DOHSTR                         * F7F10  DOHSTR
          LENGTH                                 * F7F15  length, to #F8178
          NIBHEX  D20598070FEFF3F77980908001000045 * F7F1A  -P≤pðþ?.ρ......T
          NIBHEX  9809040AAAA2A779800026803011E478 * F7F3A  ≤↑@.ª*zρ..b...Nπ
          NIBHEX  0B090AAAA2A718A780B01000F80300EE * F7F5A  °↑.ª*zāz....↓0.î
          NIBHEX  780B0A8AA4228002A880A0800E00075E * F7F7A  π°.¨J". ≥...à.på
          NIBHEX  A78090A8AA522945A808080040007598 * F7F9A  z..≥ª%δT≥∡∡...W≤
          NIBHEX  090A8AAFF3F12A808084040007298040 * F7FBA  ↑.¨ú?.¢..H@.pδ..
          NIBHEX  A82A4F80308204E8040A82A4F8030820 * F7FDA  ≥¢ô..(@←@.(J↓0∡.
          NIBHEX  4E8040E82F4E804038384F801082C801 * F7FFA  ä..←òä..√√ô..(α.
          NIBHEX  842801082C80604480044C8018428060 * F801A  H∇.∡Â..D.@Ä.ā$..
          NIBHEX  5408008780B054FE07408808780B0540 * F803A  E∡.x..Eïp.∂∡π°P.
          NIBHEX  005409408780B06C800440220F780184 * F805A  .E↑.x..Æ.@."ðπ.H
          NIBHEX  280608203E08C80608200007B8030301 * F807A  ∇`∡.ã∡α`∡..p≠00.
          NIBHEX  8F8030E00FF8030A00AF804020084E80 * F809A  ø...ð↓0..ú...∡ä.
          NIBHEX  40A00A4E804020084880A0DC0000A00A * F80BA  ...ä...∡∫..Í....
          NIBHEX  4880A094000010084880519CF8FFAF0A * F80DA  ∫..I...∡∫..É↓ÿú.
          NIBHEX  500100006484680108E680C04AC4A9AA * F80FA  ....FH▶.∡n..¤Lωª
          NIBHEX  AA0A4680104E7805188FF0300004A00A * F811A  ª.d..äπPāø...@..
          NIBHEX  8AAAA0A78030EAD46800049809094F8F * F813A  ¨ª.z..®M▶.@≤↑↑ôø
          NIBHEX  FFF03980109419018819030C801D80 * F815A  ÿ.ε..Iγ.∂γ0À.Ñ.
        ENDLENGTH                                * F8178
        }                                        * F8178

* ROMPTR 0E2 03E
* refs (1): E3857
ROMP_0E2_03E:
        {                                        * F817D
          BINT16                                 * F8182
          BINT4                                  * F8187
          CON(5)  DOHSTR                         * F818C  DOHSTR
          LENGTH                                 * F8191  length, to #F8427
          NIBHEX  F20639018ED8090FEFF3F008AB803080 * F8196  /`ε.è→↑ðþ?.∡º...
          NIBHEX  0158018EB80C040AAAA2A00221A80002 * F81B6  .Σ.è≠À@.ª*. .≥. 
          NIBHEX  88030E228980D090AAFA2B0000389804 * F81D6  ∂0à"σ...ª¯²..√≤@
          NIBHEX  0100046801028980D0A8AAE22825E528 * F81F6  ..@▶. σ..≥ª.∇R^∇
          NIBHEX  A80A080050015515B80B0A8EA473C75D * F8216  ≥.∡...UQ≠°.èJ7|Õ
          NIBHEX  5C80A081040005292B80B0A80A400052 * F8236  Å...@.Pδ²..≥...%
          NIBHEX  E2C8030808429040A80A439030808429 * F8256  .α0∡∡$..≥.4...Hδ
          NIBHEX  040E80B429040180C439030410439030 * F8276  @à.Kδ@..Lε0@.4..
          NIBHEX  2204E801822801820902823000140906 * F8296  "@←.(∇.(↑ (..A↑`
          NIBHEX  02240014090B02AFF01400011B80B02A * F82B6   B.A↑° ú.A..±..¢
          NIBHEX  4001401011B80B0362001402811B8018 * F82D6  .....≠°0&.A .±.ā
          NIBHEX  228060220441E090502207C119060410 * F82F6  ".."@...."p.γ`@.
          NIBHEX  000EF8030180C39030E80B4902080839 * F8316  .à↓0..<..←°η ∡∡ε
          NIBHEX  040A80A439030808429040A80A439030 * F8336  @..Jε0∡∡$..≥.4..
          NIBHEX  8084A80106E58040A80A4A80104A6803 * F8356  .H≥.`^..≥.¤..¤▶0
          NIBHEX  04084A80C04E00F8FFAB0A4A80104288 * F8376  @∡¤..ä.↓ÿº.¤..$∂
          NIBHEX  04085001580E010E200A8AAAA0AE8801 * F8396  @∡..Σà.à..¨ª.ê∂.
          NIBHEX  028A8018488011380000A8AAAAC4FF07 * F83B6   ¨.ā∫..√..≥ªªLÿp
          NIBHEX  58070284ACA01480002980D028AA2AA8 * F83D6  Σp HÊ.A..δ..∇ª¢≥
          NIBHEX  AA2A01B8080EAAA0100CE8090A424F9F * F83F6  ª¢.≠∡àª..À←↑.$ôù
          NIBHEX  F3FD8050A4C401F80              * F8416  ?ß..JL.↓
        ENDLENGTH                                * F8427
        }                                        * F8427

* ROMPTR 0E2 03F
* refs (1): E3857
ROMP_0E2_03F:
        {                                        * F842C
          BINT40                                 * F8431
          BINT14                                 * F8436
          CON(5)  DOHSTR                         * F843B  DOHSTR
          LENGTH                                 * F8440  length, to #F8562
          NIBHEX  9104680001580107C680001480204046 * F8445  .@▶..Σ.pl..A...d
          NIBHEX  800094804020408480A0500007F3C0C4 * F8465  ..I....H....p?.L
          NIBHEX  80003480402040A48000548040404094 * F8485  ..C....J..E....I
          NIBHEX  800096802040CE8000AE80009E8080CC * F84A5  ..i...ì..ê..é..Ì
          NIBHEX  0DDDD1D68020A2058268085920555525 * F84C5  ÐÝ.m..*P(▶∡θ.UUR
          NIBHEX  0010440C20555525002028FA3F5555E5 * F84E5  ..DÀ.UUR..∇¯óUU^
          NIBHEX  3F7F1009005555050020280C00555505 * F8505  ó÷.↑.UUP..∇À.UUP
          NIBHEX  0010440A00222202680009E8000CE800 * F8525  ..D.."" ▶.↑←.À←.
          NIBHEX  0AE80009E8000CE8000AE80009D80  * F8545  .←.↑←.À←..←.↑→
        ENDLENGTH                                * F8562
        }                                        * F8562

* ROMPTR 0E2 040
* refs (1): E3857
ROMP_0E2_040:
        {                                        * F8567
          BINT16                                 * F856C
          BINT6                                  * F8571
          CON(5)  DOHSTR                         * F8576  DOHSTR
          LENGTH                                 * F857B  length, to #F8800
          NIBHEX  C206300041A80F0E0138000080010026 * F8580  ,`...≥ðà.√.....b
          NIBHEX  800111004400001161004480A24490F1 * F85A0  ....D.....D.*D..
          NIBHEX  6500001141F8FF0000440C0154000011 * F85C0  V....↓ÿ..DÀ.E...
          NIBHEX  41004480704402F14D48050A41002480 * F85E0  ..D..D .Ô∫P...B.
          NIBHEX  F028010144000084E378070109F0338F * F8600  .∇..D..H>πp.↑.3ø
          NIBHEX  9060800300709070C00700F8B8059FD0 * F8620  ...0.....p.↓≠Pù.
          NIBHEX  7F0000C00700F8F806080030079A0008 * F8640  ÷...p.↓↓`∡..p©.∡
          NIBHEX  880007C8000C58030800898030D80858 * F8660  ∂.pα.ÀΣ0∡.σ..→∡Σ
          NIBHEX  0301B0898030A80858030150698030A8 * F8680  0..σ..≥∡Σ0..λ..≥
          NIBHEX  0858030150198030A8085801095B8030 * F86A0  ∡Σ0..γ..≥∡Σ.↑µ..
          NIBHEX  881C58030910F3B030C0419801082780 * F86C0  ∂ÁΣ0↑.?....≤.∡r.
          NIBHEX  3020A2980D043010200840822780F022 * F86E0  ..*≤Ð@...∡.(r.."
          NIBHEX  42000400888871780E022E2F00FFC9F4 * F8700  $.@.∂∂.πà âò.ÿΠO
          NIBHEX  82880E0224200040008252880F014420 * F8720  (∂à B....(%∂ð.D.
          NIBHEX  0020004E22388020847FA070C001C001 * F8740  ...ä"√..H÷......
          NIBHEX  F8070E003E00338059F107FB8070E003 * F8760  ↓pà.ã.3.θ.p¿...0
          NIBHEX  E003F8070C001C0018A0004680007E80 * F8780  .0↓pÀ.Á.ā..d..ç.
          NIBHEX  80600008008B80B06C0400003608B80B * F87A0  ...∡.¸..Æ@..c∡≠°
          NIBHEX  0540400002A06B80B0540400002A01B8 * F87C0  P... .¶..E@..¢.≠
          NIBHEX  09054040000AAD80D0440E0000A20F00 * F87E0  ↑P....Ú..Dà..*ð.
        ENDLENGTH                                * F8800
        }                                        * F8800

* ROMPTR 0E2 041
* refs (1): E3857
ROMP_0E2_041:
        {                                        * F8805
          BINT16                                 * F880A
          BINT10                                 * F880F
          CON(5)  DOHSTR                         * F8814  DOHSTR
          LENGTH                                 * F8819  length, to #F8A36
          NIBHEX  12855000F007D80707F000038B8000E4 * F881E  !X...p→pp..0¸..N
          NIBHEX  805050C501980301C55680006A80A030 * F883E  ...\.≤0.\e..¦...
          NIBHEX  00050551978050C05455580002880002 * F885E  .PP.y...EUΣ. ∂. 
          NIBHEX  680705055D501580105C385880006680 * F887E  ▶pPPÕ.Q..Å√Σ..f.
          NIBHEX  003580F0505555390000E05438578070 * F889E  .S...UUε...E√u..
          NIBHEX  C007001F780105058530FDFF78579031 * F88BE  .p.ñπ.PPX.ßÿπu..
          NIBHEX  50010050010054000054590D6405011D * F88DE  ......E..EθÐFP.Ñ
          NIBHEX  1508960544431548000B08900D84E006 * F88FE  Q∡iPD4Q∫.°∡.ÐH.`
          NIBHEX  C2200FF51518550A9405454245480001 * F891E  ,.ð_QāU.IPT$T∫..
          NIBHEX  08900884E00442200405011D15189E05 * F893E  ∡.∡H.@$.@P.ÑQāéP
          NIBHEX  44471547903150010050010054000054 * F895E  DtQt........E..E
          NIBHEX  790105058530FDFF78578070C007001F * F897E  ρ.PPX.ßÿπu...p.ñ
          NIBHEX  780F0505555390000E05438588000668 * F899E  πðPPU5..àP4X∂.`▶
          NIBHEX  0003580705055D501580105C38558000 * F89BE  .0ΣpPPÕ.Q..Å√U..
          NIBHEX  28800026805050551978050C05455680 * F89DE  ∇..b...UγπPÀPTe.
          NIBHEX  006A80A03000050C501980901C550000 * F89FE  .¦....PÀ.γ..ÁU..
          NIBHEX  38B8000E48030F007D80107F       * F8A1E  √≠.à∫0ð.×..÷
        ENDLENGTH                                * F8A36
        }                                        * F8A36

* ROMPTR 0E2 042
* refs (1): E3857
ROMP_0E2_042:
        {                                        * F8A3B
          BINT40                                 * F8A40
          BINT21                                 * F8A45
          CON(5)  DOHSTR                         * F8A4A  DOHSTR
          LENGTH                                 * F8A4F  length, to #F8B85
          NIBHEX  710410F078F607FDB001880604080001 * F8A54  .@..πopß..∂`@∡..
          NIBHEX  880604080001480403E0044800015803 * F8A74  ∂`@∡..∫@0.@∫..Σ0
          NIBHEX  28004080001000200800408000100050 * F8A94  ∇.......∡.......
          NIBHEX  080044800210008808004080001000F8 * F8AB4  ∡.D. ..∂∡......↓
          NIBHEX  08004080001580308004480001880604 * F8AD4  ∡....Q...@∫..∂`@
          NIBHEX  08000188070408000F078F307FDB1B04 * F8AF4  ∡..∂p@∡.ðpø.÷½±@
          NIBHEX  010008480A040880090008480A048840 * F8B14  ..∡∫.@∡.↑.∡∫.@∂.
          NIBHEX  450008480A1508802F0FF8F80FF7F9C3 * F8B34  T.∡∫.Q∡.òð↓↓ð.∞<
          NIBHEX  F50008480A0509202900084805148920 * F8B54  _.∡∫.P↑.δ.∡∫PAσ.
          NIBHEX  41000800F00408C00              * F8B74  ..∡..@∡.
        ENDLENGTH                                * F8B85
        }                                        * F8B85

* ROMPTR 0E2 043
* refs (1): E3857
ROMP_0E2_043:
        {                                        * F8B8A
          BINT40                                 * F8B8F
          BINT7                                  * F8B94
          CON(5)  DOHSTR                         * F8B99  DOHSTR
          LENGTH                                 * F8B9E  length, to #F8D47
          NIBHEX  52834804040102580708004011288040 * F8BA3  %8∫@@. Σp∡...∇..
          NIBHEX  5010A58070F007017E880405010A5807 * F8BC3  ..Z...p.ç∂@P..Σp
          NIBHEX  0800401128804041F021B05094240378 * F8BE3  ∡...∇.......IB0π
          NIBHEX  0504C920278050244902780509424037 * F8C03  P@Π.r..Bη πP↑$.s
          NIBHEX  80504C92027805024490278050942403 * F8C23  ..Ä) πP D.r..IB0
          NIBHEX  780504C9202780502440027805014000 * F8C43  πP@Π.r..B. πP...
          NIBHEX  388040C80027808024410220F4804214 * F8C63  √..α.r..B. .O.$A
          NIBHEX  01034088F0FF0F89FEFF880000244502 * F8C83  .0.∂.ÿðσïÿ∂..BT 
          NIBHEX  40F4808014030320858070C850200848 * F8CA3  .O..A00.X..α..∡∫
          NIBHEX  0502449027805014000388076C800200 * F8CC3  P D.r..A.0∂pÆ. .
          NIBHEX  00F0052440E203004004942483000040 * F8CE3  ..PB..0..@IB8...
          NIBHEX  3C4C9282F00040442449820800404494 * F8D03  ÃÄ)(...DBη(∡..DI
          NIBHEX  2483080040444C928208004044244982 * F8D23  B8∡..DÄ)(∡..DBη(
          NIBHEX  F280                           * F8D43  /.
        ENDLENGTH                                * F8D47
        }                                        * F8D47

* ROMPTR 0E2 044
* refs (1): E3857
ROMP_0E2_044:
        {                                        * F8D4C
          BINT56                                 * F8D51
          BINT13                                 * F8D56
          CON(5)  DOHSTR                         * F8D5B  DOHSTR
          LENGTH                                 * F8D60  length, to #F8EA0
          NIBHEX  32824049028480402403848053920280 * F8D65  #(.η H..B0H.5) .
          NIBHEX  07004902800800240380080092028008 * F8D85  p.η .∡.B0.∡.) .∡
          NIBHEX  00490280080024035803092025803049 * F8DA5  .η .∡.B0Σ0↑.R..η
          NIBHEX  0258053240300020F920200840849FEF * F8DC5   ΣP#....∞..∡.Hùþ
          NIBHEX  F8F08240300040F92020002084902480 * F8DE5  ↓.(....∞....H.B.
          NIBHEX  40824035803092025803449023E00002 * F8E05  .(.S..) Σ0D.2.. 
          NIBHEX  4030800009202080F004902880000240 * F8E25  ....↑....@.∇.. .
          NIBHEX  388000092028800004902080FF9030F0 * F8E45  √..↑.∇..@...ÿ...
          NIBHEX  0558030400458030403C580304044580 * F8E65  PΣ0@.T...ÃΣ0@@T.
          NIBHEX  304044580304044580304044580    * F8E85  ..DΣ0@@T...DΣ
        ENDLENGTH                                * F8EA0
        }                                        * F8EA0

* ROMPTR 0E2 045
* refs (1): E3857
ROMP_0E2_045:
        {                                        * F8EA5
          BINT24                                 * F8EAA
          BINT9                                  * F8EAF
          CON(5)  DOHSTR                         * F8EB4  DOHSTR
          LENGTH                                 * F8EB9  length, to #F918E
          NIBHEX  62851100248841228E843848580F0280 * F8EBE  &X..B∂."èH√∫Σð .
          NIBHEX  8412108852028580523F08C127CE8738 * F8EDE  H!.∂% X.%ó∡.rìx√
          NIBHEX  F80100002808412102852028580F024B * F8EFE  ↓...∇∡.. X.∇Σð ´
          NIBHEX  843E28E843B481B04020115581405110 * F8F1E  Hã∇←4K.....U....
          NIBHEX  9580F0A0884822228E88085801060B84 * F8F3E  Y...∂∫""è∂∡Σ.`°H
          NIBHEX  100C48048261E2888824224AE0000223 * F8F5E  .À∫@(..∂∂B"¤.. 2
          NIBHEX  115581225114910011EA2884822228E8 * F8F7E  .U.".A...®∇H("∇←
          NIBHEX  8C803012262C8440CE40058261E28888 * F8F9E  È..!bÂH.ì.P(..∂∂
          NIBHEX  24224A04012222115581225114914012 * F8FBE  B"¤@."".U.".A..!
          NIBHEX  2A7884822228E8848E4000060B84100C * F8FDE  ¢πH("∇←Hè..`°H.À
          NIBHEX  580F02022E2888824220A58040201155 * F8FFE  Σð  â∇∂($.Z....U
          NIBHEX  81405110958071A0884822228E880840 * F901E  ....Y...∂∫""è∂∡.
          NIBHEX  F00060B84500C808839F808900201155 * F903E  ...≠T.α∡8ù.σ...U
          NIBHEX  81225110980F000A0884822228E88084 * F905E  ."..≤ð..∡H("∇←.H
          NIBHEX  0800060B84F70C0080002000E0008004 * F907E  ∡.`°H.À........@
          NIBHEX  000A00005F20005001001500C8070044 * F909E  ....õ.....Q.αp.D
          NIBHEX  A0A441920E8E74080100C46314415048 * F90BE  .J.)àèG∡..L6A..∫
          NIBHEX  84420CE10144240CE1308E84710A1100 * F90DE  H$À..DBÀ..èH....
          NIBHEX  44241451510274954208110044A4A443 * F90FE  DBA.. GY$∡..DJJ4
          NIBHEX  920E8E7408110044640040004004000C * F911E  )àèG∡..DF....@.À
          NIBHEX  E101002000E0008024000A5804020115 * F913E  ........B..Σ@ .Q
          NIBHEX  5814051109580F0A0884822228E88085 * F915E  ΣAP.↑Σð.∡H("∇←.X
          NIBHEX  801060B84100C380               * F917E  ...≠..<.
        ENDLENGTH                                * F918E
        }                                        * F918E

* ROMPTR 0E2 046
* refs (1): E3857
ROMP_0E2_046:
        {                                        * F9193
          BINT8                                  * F9198
          BINT3                                  * F919D
          CON(5)  DOHSTR                         * F91A2  DOHSTR
          LENGTH                                 * F91A7  length, to #F9582
L_F91AC:
          NIBHEX  230730370258030C207D803051025803 * F91AC  2p.s Σ0À.×... Σ0
          NIBHEX  0721AD80303702580309A24D80305102 * F91CC  p.Ú..s Σ0↑*Ô... 
          NIBHEX  580302649D80303702580304A9209000 * F91EC  Σ0 FÙ..s Σ0@ω...
          NIBHEX  258050932401E8000258050274902E80 * F920C  R..9B.←. ΣP G.â.
          NIBHEX  C020000804A9204E80C0200004092240 * F922C  ...∡@ω.ä....@↑".
          NIBHEX  9E80C02000040274912E80C020000A04 * F924C  é....@ G.â.....@
          NIBHEX  A9214E80C02000050922429E80C02000 * F926C  ω.ä....P↑"$é....
          NIBHEX  028274952E80C020000984A9264E80C0 * F928C   (GYâ....↑Hωbä..
          NIBHEX  200004C9224C9E80C02000026274992E * F92AC  ..@Π"Äé.... &Gτâ
          NIBHEX  80E020000924A922401C80E020000499 * F92CC  ....↑Bω".Á....@τ
          NIBHEX  2244901C80E0200002527499202C80E0 * F92EC  "D.Á.... %Gτ.Â..
          NIBHEX  20080924A922405C80E0200404992244 * F930C  .∡↑Bω".Å...@@τ"D
          NIBHEX  906C80E0200C0242701800CC80802006 * F932C  .Æ...À $.ā.Ì...`
          NIBHEX  0924A480009C80E0200304912004A12C * F934C  ↑BJ..É...0@..@.Â
          NIBHEX  80E0200902427008A24C80E020048920 * F936C  ...↑ $.∡*Ä...@σ.
          NIBHEX  A000E49C80E0200244912E00892C8001 * F938C  ..NÉ... D.â.σÂ..
          NIBHEX  2009424074E882401A80012004A920A4 * F93AC  .↑$.G←(.¡...@ω.J
          NIBHEX  5004902A800120025491245009204A80 * F93CC  .@.¢... E.B.↑.¤.
          NIBHEX  0121093240742802409A800129000800 * F93EC  ..↑#.G∇ .©..δ.∡.
          NIBHEX  A00004932A8010254809012004092C4A * F940C  ..@9¢..R∫↑..@↑Â¤
          NIBHEX  80212703773274992244907880212305 * F942C  ..r0w#Gτ"D.π..2P
          NIBHEX  1424A922449921888021210377292244 * F944C  ABω"Dτ.∂...0wδ"D
          NIBHEX  99224E98804125851122749922449120 * F946C  τ"ä≤..RX."Gτ"D..
          NIBHEX  36804123437774A92244992241D68061 * F948C  c..24wGω"Dτ".m..
          NIBHEX  2120000922449922449E201480452550 * F94AC  ...↑"Dτ"Dé.A.TR.
          NIBHEX  000274992244992241F0000C23949924 * F94CC  . Gτ"Dτ"...À2IτB
          NIBHEX  A922449922449F201007A92244992244 * F94EC  ω"Dτ"Dù..pω"Dτ"D
          NIBHEX  992244992243F00FE59F107FBB070610 * F950C  τ"Dτ"4.ð^ù.÷»p`.
          NIBHEX  0201CE80B0800004200401E800014807 * F952C   .ì....@.@.←..∫p
          NIBHEX  04400801CD80002480704A004005D800 * F954C  @.∡.Ü..B..¤..P→.
          NIBHEX  0548070E900201DD801048         * F956C  P∫pà. .Ý..∫
        ENDLENGTH                                * F9582
        }                                        * F9582

* ROMPTR 0E2 047
* refs (1): E3857
ROMP_0E2_047:
        {                                        * F9587
          BINT40                                 * F958C
          BINT10                                 * F9591
          CON(5)  DOHSTR                         * F9596  DOHSTR
          LENGTH                                 * F959B  length, to #F97A0
          NIBHEX  9283081C80001C801054B80103878040 * F95A0  )8∡Á..Á..E≠.0x..
          NIBHEX  3C001980E0C00FEFFFF1F001458070F0 * F95C0  Ã.γ...ðþÿ...T...
          NIBHEX  7F0024580603CE001278015E80034000 * F95E0  ÷.BΣ`0ì.!π.å.0..
          NIBHEX  BA08070007400086080300064000828A * F9600  «∡p.p..h∡0.`..(¨
          NIBHEX  01000C4000828A01000C800002C50000 * F9620  ..À..(¨..À.. \..
          NIBHEX  18807800C4804618808800C000021880 * F9640  ā.π.L.dā.∂... ā.
          NIBHEX  88FE3FFF0518807810C0000318808838 * F9660  ∂ïóÿPā.π...0ā.∂√
          NIBHEX  C0800018808854C04000188078108021 * F9680  ...ā.∂E...ā.π...
          NIBHEX  000C8000108011020C478050B0206478 * F96A0  .À..... Àt....Fπ
          NIBHEX  05030207478050C82034680603DE2012 * F96C0  P0 pt..α.C▶`0í.!
          NIBHEX  68060F07D0024808074C01D00158070C * F96E0  ▶`ðp. ∫∡pÄ...ΣpÀ
          NIBHEX  00020015800240002000800020400020 * F9700  . .Q. ..........
          NIBHEX  0040002040002680002B80302401980F * F9720  ......b..²..B.≤ð
          NIBHEX  4A4000EC001000068008421020000E80 * F9740  ¤..Î...`.∡$...à.
          NIBHEX  18411040000100004900400002000841 * F9760  ā.......η... .∡.
          NIBHEX  1040000C0008421026806030EC001380 * F9780  ...À.∡$.b...Î.1.
        ENDLENGTH                                * F97A0
        }                                        * F97A0

* ROMPTR 0E2 048
* refs (1): E3857
ROMP_0E2_048:
        {                                        * F97A5
          BINT24                                 * F97AA
          BINT6                                  * F97AF
          CON(5)  DOHSTR                         * F97B4  DOHSTR
          LENGTH                                 * F97B9  length, to #F99F0
          NIBHEX  C2058804060803E804060803E804060F * F97BE  ,P∂@`∡0←@`∡0←@`ð
          NIBHEX  03D8050860803D8050860803D8050860 * F97DE  0→P∡..Ó..h∡0→P∡.
          NIBHEX  803E804060F03E804060003D80502620 * F97FE  .ã....ã....Ó..b.
          NIBHEX  03D8050164003D8050FEFF03D8050164 * F981E  0→P.F.Ó..ïÿ0→P.F
          NIBHEX  003D805026200358030F802480406000 * F983E  .Ó..b.0Σ0ð.B....
          NIBHEX  368020802480E660003802F00081E074 * F985E  c...B.n..√ ....G
          NIBHEX  00600138020007822088006000B80E07 * F987E  ...√ .p(.∂...≠àp
          NIBHEX  108228FFF0700FF8F278208A20880060 * F989E  .(∇ÿ..ð↓/π.¨.∂..
          NIBHEX  00B8020F2081E0F4006001380208A880 * F98BE  .≠ ð...O...√ ∡≥.
          NIBHEX  A06000380E0F18804060003E80406000 * F98DE  ...√àðā....ã....
          NIBHEX  3E804060003E804060003E804060003E * F98FE  ã....ã....ã....ã
          NIBHEX  804060003E804060003E804060003E80 * F991E  ....ã....ã....ã.
          NIBHEX  4060003E804060003E804060003E8040 * F993E  ...ã....ã....ã..
          NIBHEX  60003E804060003E8040600031B01038 * F995E  ..ã....ã.......√
          NIBHEX  58030C009780B0100004008108780B01 * F997E  Σ0À.y....@..∡π°.
          NIBHEX  00E0E808378780B0101015408588780B * F999E  ..←∡sx....Q.X∂π°
          NIBHEX  0101E04008188780B010110400818878 * F99BE  ....∡āx....@..∂π
          NIBHEX  0B0381E0400C179380             * F99DE  °0...Àq9.
        ENDLENGTH                                * F99F0
        }                                        * F99F0

* ROMPTR 0E2 049
* refs (1): E3857
ROMP_0E2_049:
        {                                        * F99F5
          BINT16                                 * F99FA
          BINT9                                  * F99FF
          CON(5)  DOHSTR                         * F9A04  DOHSTR
          LENGTH                                 * F9A09  length, to #F9CD8
          NIBHEX  82867807090C00312190705040041419 * F9A0E  (hπp↑À.......@Aγ
          NIBHEX  070F047C41F190705040041419070904 * F9A2E  pð@Ç......@Aγp↑@
          NIBHEX  00412BD0E0C0300CC3300CC33A80F020 * F9A4E  ..²....À<.À<£...
          NIBHEX  49922449922449980F02049922449922 * F9A6E  η)Bη)Bη≤ð @τ"Dτ"
          NIBHEX  449980F0204992244992244998010FED * F9A8E  Dτ...η)Bη)Bη≤.ðÞ
          NIBHEX  8F100378011220882200882200802780 * F9AAE  ø.0π.!.∂".∂"..r.
          NIBHEX  11220882200882200802780112208822 * F9ACE  ."∡(.∡(.∡ π.!.∂"
          NIBHEX  00882200802780112208822008822008 * F9AEE  .∂"..r.."∡(.∡(.∡
          NIBHEX  02780F7220882200882200802000F483 * F9B0E   πð'.∂".∂"....O8
          NIBHEX  A2208822008822008020411480622088 * F9B2E  *.∂".∂"....A.&.∂
          NIBHEX  22008822008020811480222088220088 * F9B4E  ".∂"....A.".∂".∂
          NIBHEX  22008E21F0F480222088220088220080 * F9B6E  ".è..O.".∂".∂"..
          NIBHEX  20811B87402220882200882200802041 * F9B8E  ..±x.".∂".∂"....
          NIBHEX  10800220882200882200802000F00002 * F9BAE  .. .∂".∂"...... 
          NIBHEX  20882200882200802780112208822008 * F9BCE  .∂".∂"..r.."∡(.∡
          NIBHEX  82200802780112208822008822008027 * F9BEE  (.∡ π.!.∂".∂"..r
          NIBHEX  801122088220088220080278010FED8F * F9C0E  .."∡(.∡(.∡ π.ðÞø
          NIBHEX  1003780F02049922449922449980F020 * F9C2E  .0πð @τ"Dτ"Dτ...
          NIBHEX  49922449922449980F02049922449922 * F9C4E  η)Bη)Bη≤ð @τ"Dτ"
          NIBHEX  44978011803F86611886611846680007 * F9C6E  Dy...óh.āh.ād▶.p
          NIBHEX  F8000478020202D8000478020204D800 * F9C8E  ↓.@π   →.@π  @→.
          NIBHEX  0468020C28E8F107F680202046902020 * F9CAE  @▶ À∇←.po...d...
          NIBHEX  2690007790                     * F9CCE  b..w.
        ENDLENGTH                                * F9CD8
        }                                        * F9CD8

* ROMPTR 0E2 04A
* refs (1): E3857
ROMP_0E2_04A:
        {                                        * F9CDD
          BINT24                                 * F9CE2
          BINT5                                  * F9CE7
          CON(5)  DOHSTR                         * F9CEC  DOHSTR
          LENGTH                                 * F9CF1  length, to #FA048
          NIBHEX  F205980006190102988030920E480105 * F9CF6  /P≤.`γ. ≤..)à∫.P
          NIBHEX  98809092010000FD78FC03F9280FF8F0 * F9D16  ≤..)...ßπÏ0∞∇ð↓.
          NIBHEX  FE780C3192000090108003008003AE00 * F9D36  ïπÀ.).....0..0ê.
          NIBHEX  006010800C0040050200005030403001 * F9D56  ....À..P .......
          NIBHEX  0001580D1882060E0020001000080076 * F9D76  ..ΣÐā(`à.....∡.g
          NIBHEX  1208002780B04006E02F800278066400 * F9D96  !∡.r...`.ò. π`F.
          NIBHEX  DD8728001E81C0000C01886A28102182 * F9DB6  Ýx∇.á...À.∂¦∇..(
          NIBHEX  20000806005A172020822000040C0044 * F9DD6  ..∡`.¥q..(..@À.D
          NIBHEX  01C040822000040C003000C04081C1C0 * F9DF6  ...(..@À........
          NIBHEX  020258020C0848050804203480301408 * F9E16    Σ À∡∫P∡@.C..A∡
          NIBHEX  48050808201480E018380001889FFF34 * F9E36  ∫P∡∡.A..ā√..∂ùÿC
          NIBHEX  80F4105000010808902B000020504005 * F9E56  .O....∡∡.².....P
          NIBHEX  0804101E0000F03F80031C0090080001 * F9E76  ∡@.á...ó.0Á..∡..
          NIBHEX  281000010000D00980FE58F013F0000B * F9E96  ∇......↑.ïΣ.1..°
          NIBHEX  00A0001201880A090080000201880619 * F9EB6  ...!.∂.↑... .∂`γ
          NIBHEX  03800002010000800809F54802010188 * F9ED6  0.. ....∡↑_∫ ..∂
          NIBHEX  0F6205100001808E80C0000207100003 * F9EF6  ð&P....è... p..0
          NIBHEX  40818080000203A0000EC18080800004 * F9F16  ..... 0..à.....@
          NIBHEX  04E0000842508080000C043028004260 * F9F36  @..∡$....À@.∇.$.
          NIBHEX  81C0000B0840541031A780B0100987C3 * F9F56  ...°∡.E..z...↑x<
          NIBHEX  0102780B0E0118C2201019803033F478 * F9F76  . π°à.ā,..γ..3Oπ
          NIBHEX  F103F580704E020282480001680E2E01 * F9F96  .0_..ä  (∫..▶àâ.
          NIBHEX  0224008003000080B100025400400500 * F9FB6   B..0..... E..P.
          NIBHEX  E061C000014C480E010020124001015B * F9FD6  .....Ä∫à...!...µ
          NIBHEX  480D010020024002E1388090E00180FF * F9FF6  ∫Ð... . .√.....ÿ
          NIBHEX  3F980302002480009980302002480009 * FA016  ó≤0 .B..τ... ∫.↑
          NIBHEX  98030E001480006780             * FA036  ≤0à.A..v.
        ENDLENGTH                                * FA048
        }                                        * FA048
